MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J65/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F86J65_H_
#define _PIC18F86J65_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F86J65
 */
#ifndef _XC_H_
#warning Header file pic18f86j65.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: MAADR5
#define MAADR5 MAADR5
extern volatile unsigned char           MAADR5              __at(0xE80);
#ifndef _LIB_BUILD
asm("MAADR5 equ 0E80h");
#endif

// Register: MAADR6
#define MAADR6 MAADR6
extern volatile unsigned char           MAADR6              __at(0xE81);
#ifndef _LIB_BUILD
asm("MAADR6 equ 0E81h");
#endif

// Register: MAADR3
#define MAADR3 MAADR3
extern volatile unsigned char           MAADR3              __at(0xE82);
#ifndef _LIB_BUILD
asm("MAADR3 equ 0E82h");
#endif

// Register: MAADR4
#define MAADR4 MAADR4
extern volatile unsigned char           MAADR4              __at(0xE83);
#ifndef _LIB_BUILD
asm("MAADR4 equ 0E83h");
#endif

// Register: MAADR1
#define MAADR1 MAADR1
extern volatile unsigned char           MAADR1              __at(0xE84);
#ifndef _LIB_BUILD
asm("MAADR1 equ 0E84h");
#endif

// Register: MAADR2
#define MAADR2 MAADR2
extern volatile unsigned char           MAADR2              __at(0xE85);
#ifndef _LIB_BUILD
asm("MAADR2 equ 0E85h");
#endif

// Register: MISTAT
#define MISTAT MISTAT
extern volatile unsigned char           MISTAT              __at(0xE8A);
#ifndef _LIB_BUILD
asm("MISTAT equ 0E8Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUSY                   :1;
        unsigned SCAN                   :1;
        unsigned NVALID                 :1;
        unsigned                        :1;
    };
} MISTATbits_t;
extern volatile MISTATbits_t MISTATbits __at(0xE8A);
// bitfield macros
#define _MISTAT_BUSY_POSN                                   0x0
#define _MISTAT_BUSY_POSITION                               0x0
#define _MISTAT_BUSY_SIZE                                   0x1
#define _MISTAT_BUSY_LENGTH                                 0x1
#define _MISTAT_BUSY_MASK                                   0x1
#define _MISTAT_SCAN_POSN                                   0x1
#define _MISTAT_SCAN_POSITION                               0x1
#define _MISTAT_SCAN_SIZE                                   0x1
#define _MISTAT_SCAN_LENGTH                                 0x1
#define _MISTAT_SCAN_MASK                                   0x2
#define _MISTAT_NVALID_POSN                                 0x2
#define _MISTAT_NVALID_POSITION                             0x2
#define _MISTAT_NVALID_SIZE                                 0x1
#define _MISTAT_NVALID_LENGTH                               0x1
#define _MISTAT_NVALID_MASK                                 0x4

// Register: EFLOCON
#define EFLOCON EFLOCON
extern volatile unsigned char           EFLOCON             __at(0xE97);
#ifndef _LIB_BUILD
asm("EFLOCON equ 0E97h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FCEN0                  :1;
        unsigned FCEN1                  :1;
        unsigned FULDPXS                :1;
    };
} EFLOCONbits_t;
extern volatile EFLOCONbits_t EFLOCONbits __at(0xE97);
// bitfield macros
#define _EFLOCON_FCEN0_POSN                                 0x0
#define _EFLOCON_FCEN0_POSITION                             0x0
#define _EFLOCON_FCEN0_SIZE                                 0x1
#define _EFLOCON_FCEN0_LENGTH                               0x1
#define _EFLOCON_FCEN0_MASK                                 0x1
#define _EFLOCON_FCEN1_POSN                                 0x1
#define _EFLOCON_FCEN1_POSITION                             0x1
#define _EFLOCON_FCEN1_SIZE                                 0x1
#define _EFLOCON_FCEN1_LENGTH                               0x1
#define _EFLOCON_FCEN1_MASK                                 0x2
#define _EFLOCON_FULDPXS_POSN                               0x2
#define _EFLOCON_FULDPXS_POSITION                           0x2
#define _EFLOCON_FULDPXS_SIZE                               0x1
#define _EFLOCON_FULDPXS_LENGTH                             0x1
#define _EFLOCON_FULDPXS_MASK                               0x4

// Register: EPAUS
#define EPAUS EPAUS
extern volatile unsigned short          EPAUS               __at(0xE98);
#ifndef _LIB_BUILD
asm("EPAUS equ 0E98h");
#endif

// Register: EPAUSL
#define EPAUSL EPAUSL
extern volatile unsigned char           EPAUSL              __at(0xE98);
#ifndef _LIB_BUILD
asm("EPAUSL equ 0E98h");
#endif

// Register: EPAUSH
#define EPAUSH EPAUSH
extern volatile unsigned char           EPAUSH              __at(0xE99);
#ifndef _LIB_BUILD
asm("EPAUSH equ 0E99h");
#endif

